webservices/prueba667.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:services-sie-com:sap:mm050ing:mm050ing">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:mm050ing>
         	<urn:SSUCURSAL>1101</urn:SSUCURSAL>
		<urn:STRANSPORTISTA/>
		<urn:STRANSPORTE/>
		<urn:SPESOENTRADA>6000</urn:SPESOENTRADA>
		<urn:SFECHAENTRADA>20160113</urn:SFECHAENTRADA>
		<urn:SHORAENTRADA>000000</urn:SHORAENTRADA>
		<urn:SPESOSALIDA>6000</urn:SPESOSALIDA>
		<urn:SFECHASALIDA>20160113</urn:SFECHASALIDA>
		<urn:SHORASALIDA>000000</urn:SHORASALIDA>
		<urn:SPESODESCARTE/>
		<urn:SPESONETO>6000</urn:SPESONETO>
		<urn:SNROPESADA>0080000667</urn:SNROPESADA>
         <urn:POSICIONES>
            <!--Zero or more repetitions:-->
            <urn:POSICIONESRow>
			<urn:PSNROREMITO>1234R12345678</urn:PSNROREMITO>
			<urn:PSFECHAREMITO>15.12.2015</urn:PSFECHAREMITO>
			<urn:PSNROLOTE>0000000540</urn:PSNROLOTE>
			<urn:PSFECHACOSECHA>15.12.2015</urn:PSFECHACOSECHA>
			<urn:PSMERCADO>NOUE</urn:PSMERCADO>
			<urn:PSMATERIAL>50111010101</urn:PSMATERIAL>
			<urn:PSLOTEAGRICOLA>FAMAILLA</urn:PSLOTEAGRICOLA>
			<urn:PSNRODOCUMENTOMATERIAL/>
			<urn:PSESPECIE>LIMON</urn:PSESPECIE>
			<urn:PSVARIEDAD>EUREKA</urn:PSVARIEDAD>
			<urn:PSFINCA>MONTE GRANDE</urn:PSFINCA>
			<urn:PSTRAZABILIDAD>25F0101</urn:PSTRAZABILIDAD>
			<urn:PSTIPOENVASE>BIN PL.BCO</urn:PSTIPOENVASE>
               <urn:PSCANTENVASES>10</urn:PSCANTENVASES>
			<urn:PSCANTPES>3000</urn:PSCANTPES>
			<urn:PSUNIDAD>KG</urn:PSUNIDAD>
			<urn:PSTIPOCORTE>TIJERA</urn:PSTIPOCORTE>
			<urn:PSCOLOR/>
			<urn:PSNROPESADA/>
			<urn:PSNROPOSICIONPESADA/>           
            </urn:POSICIONESRow>
            <urn:POSICIONESRow>
			<urn:PSNROREMITO>1234R12345678</urn:PSNROREMITO>
			<urn:PSFECHAREMITO>15.12.2015</urn:PSFECHAREMITO>
			<urn:PSNROLOTE>0000000540</urn:PSNROLOTE>
			<urn:PSFECHACOSECHA>15.12.2015</urn:PSFECHACOSECHA>
			<urn:PSMERCADO>NOUE</urn:PSMERCADO>
			<urn:PSMATERIAL>50111010101</urn:PSMATERIAL>
			<urn:PSLOTEAGRICOLA>FAMAILLA</urn:PSLOTEAGRICOLA>
			<urn:PSNRODOCUMENTOMATERIAL/>
			<urn:PSESPECIE>LIMON</urn:PSESPECIE>
			<urn:PSVARIEDAD>EUREKA</urn:PSVARIEDAD>
			<urn:PSFINCA>MONTE GRANDE</urn:PSFINCA>
			<urn:PSTRAZABILIDAD>25F0101</urn:PSTRAZABILIDAD>
			<urn:PSTIPOENVASE>BIN PL.BCO</urn:PSTIPOENVASE>
               <urn:PSCANTENVASES>10</urn:PSCANTENVASES>
			<urn:PSCANTPES>3000</urn:PSCANTPES>
			<urn:PSUNIDAD>KG</urn:PSUNIDAD>
			<urn:PSTIPOCORTE>TIJERA</urn:PSTIPOCORTE>
			<urn:PSCOLOR/>
			<urn:PSNROPESADA/>
			<urn:PSNROPOSICIONPESADA/>           
            </urn:POSICIONESRow>
         </urn:POSICIONES>
      </urn:mm050ing>
   </soapenv:Body>
</soapenv:Envelope>